api/app/controllers/apps_controller.rb

SELECT  "apps".* FROM "apps" WHERE "apps"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
---
  def show
    app = App.find_by_name!(params[:app])

INSERT INTO "apps" ("uid", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uid", "b449a093-d3c8-44f1-9555-cca8f6b212ed"], ["name", "test"], ["created_at", "2018-11-07 13:26:51.180341"], ["updated_at", "2018-11-07 13:26:51.180341"]]
---
  def create
    AppClient.create(app_params)

SELECT  "apps".* FROM "apps" WHERE "apps"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
---
  def destroy
    app = App.find_by_name!(params[:app])