api/app/controllers/releases_controller.rb

  def build
    app = App.find_by_name!(params[:app])
    stage = Stage.find_by!(app: app, name: params[:stage])
---
SELECT  "apps".* FROM "apps" WHERE "apps"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
SELECT  "stages".* FROM "stages" WHERE "stages"."app_id" = 2 AND "stages"."name" = ? LIMIT ?  [["name", "review"], ["LIMIT", 1]]

  def release
    app = App.find_by!(name: params[:app])
    stage = Stage.find_by!(app: app, name: params[:stage])
    build = Build.find_by!(version: params[:version], app: app, stage: stage)
---
SELECT  "apps".* FROM "apps" WHERE "apps"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
SELECT  "stages".* FROM "stages" WHERE "stages"."app_id" = 2 AND "stages"."name" = ? LIMIT ?  [["name", "review"], ["LIMIT", 1]]
SELECT  "builds".* FROM "builds" WHERE "builds"."version" = ? AND "builds"."app_id" = 2 AND "builds"."stage_id" = 2 LIMIT ?  [["version", "v1"], ["LIMIT", 1]]

  def promote
    app = App.find_by!(name: params[:app])
    stage = Stage.find_by!(app: app, name: params[:stage])
    build = Build.find_by!(version: params[:version], app: app, stage: stage)
---
SELECT  "apps".* FROM "apps" WHERE "apps"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
SELECT  "stages".* FROM "stages" WHERE "stages"."app_id" = 2 AND "stages"."name" = ? LIMIT ?  [["name", "review"], ["LIMIT", 1]]
SELECT  "builds".* FROM "builds" WHERE "builds"."version" = ? AND "builds"."app_id" = 2 AND "builds"."stage_id" = 2 LIMIT ?  [["version", "v1"], ["LIMIT", 1]]

  def remove
    app = App.find_by!(name: params[:app])
    stage = Stage.find_by!(app: app, name: params[:stage])
    build = Build.find_by!(version: params[:version], app: app, stage: stage)
---
SELECT  "apps".* FROM "apps" WHERE "apps"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
SELECT  "stages".* FROM "stages" WHERE "stages"."app_id" = 2 AND "stages"."name" = ? LIMIT ?  [["name", "review"], ["LIMIT", 1]]
SELECT  "builds".* FROM "builds" WHERE "builds"."version" = $1 AND "builds"."app_id" = 4 AND "builds"."stage_id" = 5 LIMIT $2  [["version", "v1"], ["LIMIT", 1]]